# Используем официальный образ Node.js
FROM node:18

# Устанавливаем рабочую директорию внутри контейнера
WORKDIR /app

# Копируем файлы package.json и package-lock.json в рабочую директорию
COPY package.json yarn.lock ./

# Устанавливаем зависимости
RUN yarn install

# Копируем все файлы из текущего каталога (включая исходный код) в рабочую директорию
COPY . .

# Собираем приложение
RUN yarn run build

# Указываем порт, на котором будет работать приложение
EXPOSE 3000

# Запускаем приложение при запуске контейнера
CMD ["yarn", "run", "dev"]